БИТУправление_медицинским_центром_демо/src/Catalogs/ПриказыМедосмотров/ПриказыМедосмотров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПриказыМедосмотров</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СправкиИИныеМедосмотры</name>
      <description>Справки и иные медосмотры</description>
    </items>
    <items>
      <name>Приказ29н</name>
      <description>Приказ 29н</description>
    </items>
    <items>
      <name>Приказ302н</name>
      <description>Приказ 302н</description>
    </items>
    <items>
      <name>Приказ342н</name>
      <description>Приказ 342н</description>
    </items>
  </predefined>
  <attributes>
    <name>ФакторСОбязДействиями</name>
    <type>
      <types>CatalogRef.ПереченьВредныхФакторовИРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантГруппировкиГруппыЗаключения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.РегистрируемыеЭлектронныеМедДокументы</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСЭМД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МакетДляПодписанияЭЦП</name>
    <type>
      <types>CatalogRef.ВнешниеОбработки</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>МакетыПечати</name>
    <attributes>
      <name>Макет</name>
      <type>
        <types>CatalogRef.ВнешниеОбработки</types>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьПрименения</name>
      <type>
        <types>EnumRef.ОбластьПримененияПФДляМО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПоля</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>37</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Синоним</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначения</name>
      <type>
        <types>String</types>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмЗаполнения</name>
      <type>
        <types>CatalogRef.ВычисляемыеЗначенияПараметров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РолиПодписей</name>
    <attributes>
      <name>Роль</name>
      <type>
        <types>CatalogRef.РолиПриПодписиМедДокументов</types>
        <types>EnumRef.РолиПодписей</types>
      </type>
    </attributes>
    <attributes>
      <name>Обязательная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>РежимНастройкиДоступности</name>
      <type>
        <types>EnumRef.РежимыНастройкиДоступностиРоли</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакДоступностиРоли</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРоли</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БИТУправление_медицинским_центром_демо/src/Enums/РолиПодписей/РолиПодписей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РолиПодписей</name>
  <enumValues>
    <name>ПредседательМедКомиссии</name>
  </enumValues>
  <enumValues>
    <name>МедицинскаяОрганизация</name>
  </enumValues>
  <enumValues>
    <name>ЛечащийВрач</name>
  </enumValues>
  <enumValues>
    <name>ЗаведующийОтделением</name>
  </enumValues>
  <enumValues>
    <name>АвторДокумента</name>
  </enumValues>
  <enumValues>
    <name>Участник</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/РежимыНастройкиДоступностиРоли/РежимыНастройкиДоступностиРоли.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РежимыНастройкиДоступностиРоли</name>
  <enumValues>
    <name>АвторДокумента</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеПараметра</name>
  </enumValues>
  <enumValues>
    <name>ДоступнаВсем</name>
  </enumValues>
  <enumValues>
    <name>ДоступнаВсемКромеАвтора</name>
  </enumValues>
  <enumValues>
    <name>МедицинскаяОрганизация</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Catalogs/ПриказыМедосмотров/Forms/НастройкаРоли/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкиРоли") Тогда
		Если Параметры.НастройкиРоли.Роль = Перечисления.РолиПодписей.МедицинскаяОрганизация Тогда
			ПодписьМедицинскойОрганизации = Истина;
			Обязательная = Параметры.НастройкиРоли.Обязательная;
		Иначе
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.НастройкиРоли);
			Если РежимНастройкиДоступности = Перечисления.РежимыНастройкиДоступностиРоли.ЗначениеПараметра Тогда
				ПараметрШаблонаТекущий = Параметры.НастройкиРоли.ПризнакДоступностиРоли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мПараметрыШаблона = Новый Массив;
	
	СсылкаИдентификаторОбъектовМетаданныхСотрудники = ПолучитьСсылкуИдентификаторыОбъектовМетаданныхСотрудники();
	
	Для Каждого СтрокаПараметра Из ЭтотОбъект.ВладелецФормы.Объект.ДополнительныеПоля Цикл
		Если СтрокаПараметра.ТипЗначения = СсылкаИдентификаторОбъектовМетаданныхСотрудники Тогда
			мПараметрыШаблона.Добавить(СтрокаПараметра.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	//СписокВыбора = Новый ФиксированныйМассив(мПараметрыШаблона);
	Элементы.ПараметрШаблона.СписокВыбора.ЗагрузитьЗначения(мПараметрыШаблона);
	Элементы.ПараметрШаблона.СписокВыбора.Добавить("умц_ДокументОбъектПредседательМедКомиссии", "Документ.ПредседательМедКомиссии");
	ПараметрШаблона = ПараметрШаблонаТекущий;
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСсылкуИдентификаторыОбъектовМетаданныхСотрудники()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИдентификаторыОбъектовМетаданных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
		|ГДЕ
		|	ИдентификаторыОбъектовМетаданных.Имя = ""Сотрудники""";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	КлючСохраненияПоложенияОкна = ПодписьМедицинскойОрганизации;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если Не ПодписьМедицинскойОрганизации
		И (Не ЗначениеЗаполнено(Роль)
			Или Не ЗначениеЗаполнено(РежимНастройкиДоступности)
			Или (РежимНастройкиДоступности = ПредопределенноеЗначение("Перечисление.РежимыНастройкиДоступностиРоли.ЗначениеПараметра")
				И Не ЗначениеЗаполнено(ПараметрШаблона)))
	Тогда
		Сообщить(НСтр("ru='Не все обязательные поля заполнены!'"));
		Возврат;
	КонецЕсли;
	
	НастройкиРоли = Новый Структура("Обязательная, Роль, РежимНастройкиДоступности, ПризнакДоступностиРоли");
	Если ПодписьМедицинскойОрганизации Тогда
		НастройкиРоли.Обязательная = Обязательная;
		НастройкиРоли.Роль = ПредопределенноеЗначение("Перечисление.РолиПодписей.МедицинскаяОрганизация");
		НастройкиРоли.РежимНастройкиДоступности = ПредопределенноеЗначение("Перечисление.РежимыНастройкиДоступностиРоли.МедицинскаяОрганизация");
	Иначе
		ЗаполнитьЗначенияСвойств(НастройкиРоли, ЭтотОбъект);
		Если РежимНастройкиДоступности = ПредопределенноеЗначение("Перечисление.РежимыНастройкиДоступностиРоли.ЗначениеПараметра") Тогда
			НастройкиРоли.ПризнакДоступностиРоли = ПараметрШаблона;
		КонецЕсли;
	КонецЕсли;
	
	Закрыть(НастройкиРоли);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура РежимНастройкиДоступностиПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
	Если Не РежимНастройкиДоступности = ПредопределенноеЗначение("Перечисление.РежимыНастройкиДоступностиРоли.ЗначениеПараметра") Тогда
		ПараметрШаблона = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписьМедицинскойОрганизацииПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьВидимостьЭлементов()
	
	Элементы.ПоляВвода.Видимость = Не ПодписьМедицинскойОрганизации;
	Элементы.ПараметрШаблона.Видимость = РежимНастройкиДоступности = ПредопределенноеЗначение("Перечисление.РежимыНастройкиДоступностиРоли.ЗначениеПараметра");
	Элементы.ПараметрШаблона.АвтоОтметкаНезаполненного = Элементы.ПараметрШаблона.Видимость;
	
КонецПроцедуры

#КонецОбласти
